app/Controllers/menucontroller.php

SELECT *
FROM `tb_menu`
---
    public function tampil()
    {
        $data['data']=$this->menus->findAll();

INSERT INTO `tb_menu` (`nama`, `harga`, `jenis`, `stok`) VALUES ('mi ayam', '7000', 'makanan', '5')
---
    public function simpan()
    {
        $data = array(
            'nama'=>$this->request->getPost('nama'),
            'harga'=>$this->request->getPost('harga'),
            'jenis'=>$this->request->getPost('jenis'),
            'stok'=>$this->request->getPost('stok'),
        );
        $this->menus->insert($data);

DELETE FROM `tb_menu`
WHERE `id` IN ('7')
---
    public function delete($id)
    {
        # code...
        $this->menus->delete($id);

UPDATE `tb_menu` SET `nama` = 'mi ayam', `harga` = '7000', `jenis` = 'camilan', `stok` = '10'
WHERE `tb_menu`.`id` IN ('7')
---
    public function edit($id)
    {
            $data = array(
                'nama'=>$this->request->getPost('nama'),
                'harga'=>$this->request->getPost('harga'),
                'jenis'=>$this->request->getPost('jenis'),
                'stok'=>$this->request->getPost('stok'),
            );
            $this->menus->update($id,$data);