app/Controllers/PesananController.php

SELECT `id`, `nama`
FROM `tb_menu`
---
    public function index()
    {
        $data ['data']= $this->menu->select('id,nama')->findAll();

INSERT INTO `tb_pesanan` (`tanggal`, `user_id`, `no_meja`, `nama_pemesan`, `total_harga`) VALUES ('2022/03/04 20:22:30', '1', '23', 'mila', '0')
UPDATE `tb_pesanan` SET `total_harga` = 12000
WHERE `tb_pesanan`.`id` IN (24)
---
    public function simpan()
    {
        if(session('cart') !=null){
            $data = array(
                'tanggal'=>date('Y/m/d H:i:s'),
                'user_id'=>$this->session->get('id'),
                'no_meja'=>$this->request->getPost('no_meja'),
                'nama_pemesan'=>$this->request->getPost('nama_pemesan'),
                'total_harga'=>'0'
            );
            $id = $this->pesanan->insert($data);
            $cart = array_values(session('cart'));

            $tharga=0;
            foreach($cart as $val){
                $datadetail = array(
                    'pesanan_id'=>$id,
                    'menu_id'=>$val['menu_id'],
                    'jumlah'=>$val['jumlah'],
                    'harga'=>$val['harga'],
                );
                $tharga +=$val['jumlah']*$val['harga'];
                $this->detail->insert($datadetail);
            }
            $this->session->remove('cart');
            $dtharga= array(
                'total_harga'=>$tharga
            );
            $this->pesanan->update($id, $dtharga);