app/Controllers/usercontroller.php

    public function tampil()
    {
        $data['data'] = $this->users->findAll();
---
SELECT *
FROM `tb_user`